azuredevspaces.azds
bencoleman.armview
bierner.emojisense
burtlo.inspec
chef-software.chef
CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
DotJoshJohnson.xml
formulahendry.code-runner
GitHub.github-vscode-theme
golang.go
googlecloudtools.cloudcode
hashicorp.terraform
jchannon.csharpextensions
mindaro-dev.file-downloader
mindaro.mindaro
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-cosmosdb
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-kubernetes-tools.vscode-aks-tools
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-account
ms-vscode.azurecli
ms-vscode.powershell
ms-vsts.team
mutantdino.resourcemonitor
Pivotal.vscode-spring-boot
rebornix.ruby
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-icons-team.vscode-icons
wingrunr21.vscode-ruby